In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('employees.csv')

In [4]:
df

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [5]:
df.shape

(1000, 8)

In [6]:
df.describe

<bound method NDFrame.describe of     First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1       Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
3        Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4        Larry    Male   1/24/1998         4:47 PM  101004    1.389
..         ...     ...         ...             ...     ...      ...
995      Henry     NaN  11/23/2014         6:09 AM  132483   16.655
996    Phillip    Male   1/31/1984         6:30 AM   42392   19.675
997    Russell    Male   5/20/2013        12:39 PM   96914    1.421
998      Larry    Male   4/20/2013         4:45 PM   60500   11.985
999     Albert    Male   5/15/2012         6:24 PM  129949   10.169

    Senior Management                  Team
0                True             Marketing
1                True                   NaN
2               False               Finance
3                True               Finance
4                True       Client Services
..                ...                   ...
995             False          Distribution
996             False               Finance
997             False               Product
998             False  Business Development
999              True                 Sales

[1000 rows x 8 columns]>

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [8]:
# changing Start Date to datetime
df["Start Date"] = pd.to_datetime(df["Start Date"])

In [9]:
df.dtypes

First Name                   object
Gender                       object
Start Date           datetime64[ns]
Last Login Time              object
Salary                        int64
Bonus %                     float64
Senior Management            object
Team                         object
dtype: object

In [10]:
# it will tell ho wmany unique values are there 
df.nunique()
#it shows that first name has 200 unique values and so on

First Name           200
Gender                 2
Start Date           972
Last Login Time      720
Salary               995
Bonus %              971
Senior Management      2
Team                  10
dtype: int64

In [11]:
df.isnull().sum()
#will show null values in each column

First Name            67
Gender               145
Start Date             0
Last Login Time        0
Salary                 0
Bonus %                0
Senior Management     67
Team                  43
dtype: int64

In [12]:
#remove null
#1. by dropping null
#2. by replace
#3. by filling by mean,medianetc

#Fill the null in gendercolumn by saying NO gender 
df["Gender"]=df["Gender"].fillna("No Gender")

In [13]:
df.isnull().sum()

First Name           67
Gender                0
Start Date            0
Last Login Time       0
Salary                0
Bonus %               0
Senior Management    67
Team                 43
dtype: int64

In [18]:
#group by gender
df2=df.groupby(['Gender']).count()

In [19]:
#fill the senior management with the mode value
df["Senior Management"]=df["Senior Management" ].fillna(df["Senior Management"].mode()[0])
df.isnull().sum()

First Name           67
Gender                0
Start Date            0
Last Login Time       0
Salary                0
Bonus %               0
Senior Management     0
Team                 43
dtype: int64

In [20]:
#write the df to final_df to csv
df.to_csv('final_file.csv')
final_df = pd.read_csv('final_file.csv')
final_df

,Unnamed: 0,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,1,Thomas,Male,1996-03-31,6:53 AM,61933,4.170,True,NaN
2,2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance
3,3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance
4,4,Larry,Male,1998-01-24,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...,...
995,995,Henry,No Gender,2014-11-23,6:09 AM,132483,16.655,False,Distribution
996,996,Phillip,Male,1984-01-31,6:30 AM,42392,19.675,False,Finance
997,997,Russell,Male,2013-05-20,12:39 PM,96914,1.421,False,Product
998,998,Larry,Male,2013-04-20,4:45 PM,60500,11.985,False,Business Development
999,999,Albert,Male,2012-05-15,6:24 PM,129949,10.169,True,Sales